# Day 1 CHALLENGE
You own a business called ABC. To drive dependable decisions using data, you will develop an SQL database, call it ABC_DATA, which you will use to store all your customer info, customer orders, product info and your order information.

In these series of challenges, in SQL you are going to do the following:

1. Create a database and name it ABC_DATA
2. Create 4 tables

In [2]:
!pip install pymysql

Collecting pymysql
  Downloading PyMySQL-1.1.0-py3-none-any.whl (44 kB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 44.8/44.8 kB 1.2 MB/s eta 0:00:00
Installing collected packages: pymysql
Successfully installed pymysql-1.1.0

In [3]:
# Load the sql extension
%load_ext sql

In [4]:
# Creating ABC_DATA database

%%sql

sqlite:///ABC_DATA.db

In [5]:
# Creating tables
%%sql

--Customers data

CREATE TABLE IF NOT EXISTS customers(
  customer_id INT PRIMARY KEY,
  first_name VARCHAR(30),
  last_name VARCHAR(30),
  email VARCHAR(100)
);

--products table
CREATE TABLE IF NOT EXISTS products(
  product_id INT PRIMARY KEY,
  product_name VARCHAR(40),
  price FLOAT
);

--orders table
CREATE TABLE IF NOT EXISTS orders(
  order_id INT PRIMARY KEY,
  customer_id INT,
  order_date DATE,
  FOREIGN KEY (customer_id) REFERENCES customers(customer_id)

);

--order items table
CREATE TABLE IF NOT EXISTS order_items(
  order_id INT,
  Product_id INT,
  quantity INT,
  FOREIGN KEY (order_id) REFERENCES customers(order_id)
  FOREIGN KEY (product_id) REFERENCES products(product_id)

);

 * sqlite:///ABC_DATA.db
Done.
Done.
Done.
Done.

[]

# Day 2 CHALLENGE
Here you will insert data, into your database, readying it for quering in the subsequent day's challenges :

In [6]:
%%sql

INSERT INTO customers (customer_id, first_name, last_name, email)
VALUES
    (1, 'John', 'Doe', 'johndoe@email.com'),
    (2, 'Jane', 'Smith', 'janesmith@email.com'),
    (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
    (4, 'Alice', 'Brown', 'alicebrown@email.com'),
    (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
    (6, 'Eva', 'Fisher', 'evafisher@email.com'),
    (7, 'George', 'Harris', 'georgeharris@email.com'),
    (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
    (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
    (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
    (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
    (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
    (13, 'Sophia', 'Thomas', 'sophiathomas@email.com');

 * sqlite:///ABC_DATA.db
13 rows affected.

[]

In [7]:
%%sql

 INSERT INTO products (product_id, product_name, price)
 VALUES
    (1, 'Product A', 10.00),
    (2, 'Product B', 15.00),
    (3, 'Product C', 20.00),
    (4, 'Product D', 25.00),
    (5, 'Product E', 30.00),
    (6, 'Product F', 35.00),
    (7, 'Product G', 40.00),
    (8, 'Product H', 45.00),
    (9, 'Product I', 50.00),
    (10, 'Product J', 55.00),
    (11, 'Product K', 60.00),
    (12, 'Product L', 65.00),
    (13, 'Product M', 70.00);

 * sqlite:///ABC_DATA.db
13 rows affected.

[]

In [8]:
%%sql
INSERT INTO orders (order_id, customer_id, order_date)
VALUES
    (1, 1, '2023-05-01'),
    (2, 2, '2023-05-02'),
    (3, 3, '2023-05-03'),
    (4, 1, '2023-05-04'),
    (5, 2, '2023-05-05'),
    (6, 3, '2023-05-06'),
    (7, 4, '2023-05-07'),
    (8, 5, '2023-05-08'),
    (9, 6, '2023-05-09'),
    (10, 7, '2023-05-10'),
    (11, 8, '2023-05-11'),
    (12, 9, '2023-05-12'),
    (13, 10, '2023-05-13'),
    (14, 11, '2023-05-14'),
    (15, 12, '2023-05-15'),
    (16, 13, '2023-05-16');

 * sqlite:///ABC_DATA.db
16 rows affected.

[]

In [9]:
%%sql

INSERT INTO order_items (order_id, product_id, quantity)
VALUES
    (1, 1, 2),
    (1, 2, 1),
    (2, 2, 1),
    (2, 3, 3),
    (3, 1, 1),
    (3, 3, 2),
    (4, 2, 4),
    (4, 3, 1),
    (5, 1, 1),
    (5, 3, 2),
    (6, 2, 3),
    (6, 1, 1),
    (7, 4, 1),
    (7, 5, 2),
    (8, 6, 3),
    (8, 7, 1),
    (9, 8, 2),
    (9, 9, 1),
    (10, 10, 3),
    (10, 11, 2),
    (11, 12, 1),
    (11, 13, 3),
    (12, 4, 2),
    (12, 5, 1),
    (13, 6, 3),
    (13, 7, 2),
    (14, 8, 1),
    (14, 9, 2),
    (15, 10, 3),
    (15, 11, 1),
    (16, 12, 2),
    (16, 13, 3);

 * sqlite:///ABC_DATA.db
32 rows affected.

[]

# Day 3 CHALLENGE

Your task is to answer the following two questions:

Which product has the highest price? Only return a single row.

Which order_id had the highest number of items in terms of quantity

In [10]:
%%sql

--product with the highest price
SELECT *
FROM products
ORDER BY price DESC
LIMIT 1;

 * sqlite:///ABC_DATA.db
Done.

[(13, 'Product M', 70.0)]

In [11]:
%%sql

--order_id with the highest number of items in terms of quantity

SELECT order_id
FROM order_items
ORDER BY quantity DESC
LIMIT 1;

 * sqlite:///ABC_DATA.db
Done.

[(4,)]

# Day 4 Challenge

Which customer has made the most orders?
Hint, your query will have the following structure:

    SELECT order_counts as (
    SELECT customer_id, count(order_id) AS order_count
    FROM xxxx
    GROUP BY xxxx),
    max_order_count AS (
    SELECT max(order_count) as max_count
    FROM xxxx )
    SELECT c.first_name, c.last_name
    FROM xxxx c
    JOIN order_counts oc ON c.customer_id = oc.customer_id
    JOIN max_order_count moc ON oc.order_count = moc.max_count;
What’s the total revenue per product?
Hint: Your Query WIll have the following structure :

    SELECT p.product_name,
    p.price * sum(oi.quantity) AS total_revenue
    FROM xxxx p
    JOIN order_items oi ON oi.product_id = p.product_id
    GROUP BY xxxx p.xxx, p.xxx,
    ORDER BY 2 desc;

In [12]:
%%sql

SELECT *
FROM orders;

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, '2023-05-01'),
 (2, 2, '2023-05-02'),
 (3, 3, '2023-05-03'),
 (4, 1, '2023-05-04'),
 (5, 2, '2023-05-05'),
 (6, 3, '2023-05-06'),
 (7, 4, '2023-05-07'),
 (8, 5, '2023-05-08'),
 (9, 6, '2023-05-09'),
 (10, 7, '2023-05-10'),
 (11, 8, '2023-05-11'),
 (12, 9, '2023-05-12'),
 (13, 10, '2023-05-13'),
 (14, 11, '2023-05-14'),
 (15, 12, '2023-05-15'),
 (16, 13, '2023-05-16')]

In [13]:
%%sql

SELECT *
FROM customers;

 * sqlite:///ABC_DATA.db
Done.

[(1, 'John', 'Doe', 'johndoe@email.com'),
 (2, 'Jane', 'Smith', 'janesmith@email.com'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com'),
 (5, 'Charlie', 'Davis', 'charliedavis@email.com'),
 (6, 'Eva', 'Fisher', 'evafisher@email.com'),
 (7, 'George', 'Harris', 'georgeharris@email.com'),
 (8, 'Ivy', 'Jones', 'ivyjones@email.com'),
 (9, 'Kevin', 'Miller', 'kevinmiller@email.com'),
 (10, 'Lily', 'Nelson', 'lilynelson@email.com'),
 (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com'),
 (12, 'Quinn', 'Roberts', 'quinnroberts@email.com'),
 (13, 'Sophia', 'Thomas', 'sophiathomas@email.com')]

In [14]:
%%sql

SELECT customer_id, COUNT(order_id) AS order_count
FROM orders
GROUP BY customer_id

 * sqlite:///ABC_DATA.db
Done.

[(1, 2),
 (2, 2),
 (3, 2),
 (4, 1),
 (5, 1),
 (6, 1),
 (7, 1),
 (8, 1),
 (9, 1),
 (10, 1),
 (11, 1),
 (12, 1),
 (13, 1)]

In [15]:
%%sql

-- Which customer has made the most orders?
SELECT customers.first_name, customers.last_name
FROM customers
WHERE customers.customer_id IN (
  SELECT  COUNT(order_id) AS order_counts
  FROM orders
  GROUP BY orders.customer_id
  LIMIT 1

);

 * sqlite:///ABC_DATA.db
Done.

[('Jane', 'Smith')]

Customer with the most orders is Jane Smith

In [16]:
%%sql
--Which customer has made the most orders?

SELECT customers.first_name, customers.last_name
FROM customers
WHERE customers.customer_id IN (
  SELECT  COUNT(order_id) AS order_counts
  FROM orders
  GROUP BY orders.customer_id
  );

 * sqlite:///ABC_DATA.db
Done.

[('John', 'Doe'), ('Jane', 'Smith')]

In [17]:
%%sql

SELECT *
FROM products;

 * sqlite:///ABC_DATA.db
Done.

[(1, 'Product A', 10.0),
 (2, 'Product B', 15.0),
 (3, 'Product C', 20.0),
 (4, 'Product D', 25.0),
 (5, 'Product E', 30.0),
 (6, 'Product F', 35.0),
 (7, 'Product G', 40.0),
 (8, 'Product H', 45.0),
 (9, 'Product I', 50.0),
 (10, 'Product J', 55.0),
 (11, 'Product K', 60.0),
 (12, 'Product L', 65.0),
 (13, 'Product M', 70.0)]

In [18]:
%%sql

SELECT *
FROM order_items;

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, 2),
 (1, 2, 1),
 (2, 2, 1),
 (2, 3, 3),
 (3, 1, 1),
 (3, 3, 2),
 (4, 2, 4),
 (4, 3, 1),
 (5, 1, 1),
 (5, 3, 2),
 (6, 2, 3),
 (6, 1, 1),
 (7, 4, 1),
 (7, 5, 2),
 (8, 6, 3),
 (8, 7, 1),
 (9, 8, 2),
 (9, 9, 1),
 (10, 10, 3),
 (10, 11, 2),
 (11, 12, 1),
 (11, 13, 3),
 (12, 4, 2),
 (12, 5, 1),
 (13, 6, 3),
 (13, 7, 2),
 (14, 8, 1),
 (14, 9, 2),
 (15, 10, 3),
 (15, 11, 1),
 (16, 12, 2),
 (16, 13, 3)]

In [19]:
%%sql

SELECT *
FROM order_items
GROUP BY order_id;

 * sqlite:///ABC_DATA.db
Done.

[(1, 1, 2),
 (2, 2, 1),
 (3, 1, 1),
 (4, 2, 4),
 (5, 1, 1),
 (6, 2, 3),
 (7, 4, 1),
 (8, 6, 3),
 (9, 8, 2),
 (10, 10, 3),
 (11, 12, 1),
 (12, 4, 2),
 (13, 6, 3),
 (14, 8, 1),
 (15, 10, 3),
 (16, 12, 2)]

In [20]:
%%sql

--Total revenue per product
SELECT p.product_name, p.price * SUM(oi.quantity) AS total_revenue
FROM products p
JOIN order_items oi
ON oi.product_id = p.product_id
GROUP BY product_name
ORDER BY total_revenue DESC;

 * sqlite:///ABC_DATA.db
Done.

[('Product M', 420.0),
 ('Product J', 330.0),
 ('Product F', 210.0),
 ('Product L', 195.0),
 ('Product K', 180.0),
 ('Product C', 160.0),
 ('Product I', 150.0),
 ('Product H', 135.0),
 ('Product B', 135.0),
 ('Product G', 120.0),
 ('Product E', 90.0),
 ('Product D', 75.0),
 ('Product A', 50.0)]

# Day 5 Challenge

 Your task will be to answer the following questions:

1. Find the first order (by date) for each customer.
2. What’s the total revenue per product?
3. Find the day with the highest revenue. Hint : Your Query will have the following Syntax:


                         SELECT
                         c.first_name,
                         c.last_name,
                         p.price FROM xxxx o
                         JOIN order_items oi on oi.order_id = o.order_id
                         JOIN products p on p.product_id =oi.product_id
                         JOIN customers c on c.customer_id=o.customer_id
                         WHERE price=(SELECT XXX(xxx) FROM xxxx );

In [21]:
%%sql
SELECT *
FROM customers c
LEFT JOIN orders o
ON c.customer_id = o.customer_id;

 * sqlite:///ABC_DATA.db
Done.

[(1, 'John', 'Doe', 'johndoe@email.com', 1, 1, '2023-05-01'),
 (1, 'John', 'Doe', 'johndoe@email.com', 4, 1, '2023-05-04'),
 (2, 'Jane', 'Smith', 'janesmith@email.com', 2, 2, '2023-05-02'),
 (2, 'Jane', 'Smith', 'janesmith@email.com', 5, 2, '2023-05-05'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com', 3, 3, '2023-05-03'),
 (3, 'Bob', 'Johnson', 'bobjohnson@email.com', 6, 3, '2023-05-06'),
 (4, 'Alice', 'Brown', 'alicebrown@email.com', 7, 4, '2023-05-07'),
 (5, 'Charlie', 'Davis', 'charliedavis@email.com', 8, 5, '2023-05-08'),
 (6, 'Eva', 'Fisher', 'evafisher@email.com', 9, 6, '2023-05-09'),
 (7, 'George', 'Harris', 'georgeharris@email.com', 10, 7, '2023-05-10'),
 (8, 'Ivy', 'Jones', 'ivyjones@email.com', 11, 8, '2023-05-11'),
 (9, 'Kevin', 'Miller', 'kevinmiller@email.com', 12, 9, '2023-05-12'),
 (10, 'Lily', 'Nelson', 'lilynelson@email.com', 13, 10, '2023-05-13'),
 (11, 'Oliver', 'Patterson', 'oliverpatterson@email.com', 14, 11, '2023-05-14'),
 (12, 'Quinn', 'Roberts', 'quinnroberts@email.com', 15, 12, '2023-05-15'),
 (13, 'Sophia', 'Thomas', 'sophiathomas@email.com', 16, 13, '2023-05-16')]

In [22]:
%%sql
--First order by date for each customer
SELECT c.customer_id, c.first_name, c.last_name,MIN(o.order_date) AS first_order_date
FROM customers c
LEFT JOIN orders o
ON c.customer_id = o.customer_id
GROUP BY c.customer_id;

 * sqlite:///ABC_DATA.db
Done.

[(1, 'John', 'Doe', '2023-05-01'),
 (2, 'Jane', 'Smith', '2023-05-02'),
 (3, 'Bob', 'Johnson', '2023-05-03'),
 (4, 'Alice', 'Brown', '2023-05-07'),
 (5, 'Charlie', 'Davis', '2023-05-08'),
 (6, 'Eva', 'Fisher', '2023-05-09'),
 (7, 'George', 'Harris', '2023-05-10'),
 (8, 'Ivy', 'Jones', '2023-05-11'),
 (9, 'Kevin', 'Miller', '2023-05-12'),
 (10, 'Lily', 'Nelson', '2023-05-13'),
 (11, 'Oliver', 'Patterson', '2023-05-14'),
 (12, 'Quinn', 'Roberts', '2023-05-15'),
 (13, 'Sophia', 'Thomas', '2023-05-16')]

In [23]:
%%sql
--Total revenue per product
SELECT p.product_name, p.price * SUM(oi.quantity) AS total_revenue
FROM products p
JOIN order_items oi
ON oi.product_id = p.product_id
GROUP BY product_name
ORDER BY total_revenue DESC;

 * sqlite:///ABC_DATA.db
Done.

[('Product M', 420.0),
 ('Product J', 330.0),
 ('Product F', 210.0),
 ('Product L', 195.0),
 ('Product K', 180.0),
 ('Product C', 160.0),
 ('Product I', 150.0),
 ('Product H', 135.0),
 ('Product B', 135.0),
 ('Product G', 120.0),
 ('Product E', 90.0),
 ('Product D', 75.0),
 ('Product A', 50.0)]

In [40]:
%%sql
--Day with the highest revenue
SELECT  strftime('%d', order_date) AS day_of_month, p.price * SUM(oi.quantity) AS total_revenue
FROM order_items oi
JOIN orders o
ON oi.order_id = o.order_id
JOIN products p
ON oi.product_id = p.product_id
GROUP BY day_of_month
ORDER BY total_revenue DESC;

 * sqlite:///ABC_DATA.db
Done.

[('16', 325.0),
 ('10', 275.0),
 ('11', 260.0),
 ('15', 220.0),
 ('13', 175.0),
 ('08', 140.0),
 ('14', 135.0),
 ('09', 135.0),
 ('12', 75.0),
 ('07', 75.0),
 ('04', 75.0),
 ('06', 60.0),
 ('02', 60.0),
 ('05', 30.0),
 ('03', 30.0),
 ('01', 30.0)]

The 16th day had the highest revenue during the month